<?php
require_once("init.php");

$date_array = [
    '20260821',
    '20260814',
    '20260807',
    '20260731',
    '20260724',
    '20260717',
    '20260709',
    '20260703',
    '20260626',
    '20260618',
    '20260612',
    '20260605',
    '20260529',
    '20260522',
    '20260515',
    '20260508',
    '20260430',
    '20260424',
    '20260417',
    '20260410',
    '20260402',
    '20260327',
    '20260320',
    '20260313',
    '20260306',
    '20260226',
    '20260213',
    '20260206',
    '20260130',
    '20260123',
    '20260116',
    '20260109',
    '20260102',
    '20251226',
    '20251219',
    '20251212',
    '20251205',
    '20251128',
    '20251121',
    '20251114',
    '20251107',
    '20251031',
    '20251023',
    '20251017',
    '20251009',
    '20251003',
    '20250926',
    '20250919',
    '20250912',
    '20250905',
    '20250829'
];

$targetDate = '2026-08-14';
$stock_id = "2449";
$date = str_replace("-", "", $targetDate);
$arg1 = escapeshellarg($stock_id);
$arg2 = escapeshellarg($date);

// 執行 node 腳本並取得 console.log 的輸出
$rawOutput = shell_exec("node prefetch_TDCC.js {$arg1} {$arg2}");
// echo $rawOutput;
// 解析 JSON
$data = json_decode($rawOutput, true);

if ($data && $data['status'] === 'success') {
    echo "成功接收到 " . count($data['items']) . " 筆資料！\n";
    foreach ($data['items'] as $item) {
        echo "- ID: {$item['id']}, Name: {$item['name']}\n";
    }
} else {
    echo "資料擷取失敗\n";
    exit(1);
}
